#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x40 (0x370 - 0x330)
// BlueprintGeneratedClass BP_PalMapObjectSpawner_SkillFruits_Grass.BP_PalMapObjectSpawner_SkillFruits_Grass_C
class ABP_PalMapObjectSpawner_SkillFruits_Grass_C : public APalMapObjectSpawnerMultiItem
{
public:
	class UNiagaraComponent*                     NS_SkillFruitsTree;                                // 0x330(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  SM_FlowerMerge;                                    // 0x338(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                  PointLight;                                        // 0x340(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  SM_SkillFruitsTree;                                // 0x348(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPalMapObjectSpawnerDamageReactionComponent* DamageReaction;                                    // 0x350(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_MapObjectSpawnerLocationComponent_SkillFruits_C* LocationComponent_SkillFruits2;                    // 0x358(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_MapObjectSpawnerLocationComponent_SkillFruits_C* LocationComponent_SkillFruits1;                    // 0x360(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_MapObjectSpawnerLocationComponent_SkillFruits_C* LocationComponent_SkillFruits;                     // 0x368(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABP_PalMapObjectSpawner_SkillFruits_Grass_C* GetDefaultObj();

};

}


