#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x50 (0x4B0 - 0x460)
// BlueprintGeneratedClass BP_SquadNPCSpawner_ForCamp_Hunter_Grass.BP_SquadNPCSpawner_ForCamp_Hunter_Grass_C
class ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C : public ABP_SquadNPCSpawner_ForCampBase_C
{
public:
	class UBP_NPCPathWalkPointComponent_1_C*     BP_NPCPathWalkPointComponent_1;                    // 0x460(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCPathWalkPointComponent_1_C*     BP_NPCPathWalkPointComponent_6;                    // 0x468(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCPathWalkPointComponent_1_C*     BP_NPCPathWalkPointComponent_5;                    // 0x470(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCPathWalkPointComponent_1_C*     BP_NPCPathWalkPointComponent_4;                    // 0x478(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCPathWalkPointComponent_1_C*     BP_NPCPathWalkPointComponent_3;                    // 0x480(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCPathWalkPointComponent_1_C*     BP_NPCPathWalkPointComponent_2;                    // 0x488(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCSpawnPointComponent_C*          BP_NPCSpawnPointComponent3;                        // 0x490(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCSpawnPointComponent_C*          BP_NPCSpawnPointComponent2;                        // 0x498(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCSpawnPointComponent_C*          BP_NPCSpawnPointComponent1;                        // 0x4A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCSpawnPointComponent_C*          BP_NPCSpawnPointComponent;                         // 0x4A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C* GetDefaultObj();

};

}


